// var map = new BMap.Map("bdmap"); // 显示地图
//     map.enableScrollWheelZoom(true); // 可以缩放
//     // function theLocation(){
//     //     var new_point = new BMap.Point(30.87634827797537, 120.12831498812857);
//     //     var marker = new BMap.Marker(new_point);  // 创建标注
//     //     map.addOverlay(marker);              // 将标注添加到地图中     
        
//     // }
//     var geolocationControl = new BMap.GeolocationControl({
//             anchor: BMAP_ANCHOR_TOP_RIGHT,
//             showAddressBar: false, //是否显示定位信息面板
//             enableAutoLocation : false,  //首次是否进行自动定位
//             offset: new BMap.Size(6,6),//偏移距离
//             locationIcon: new BMap.Icon("../static/img/marker.png", new BMap.Size(22, 30))//定位点图片显示
//         });

//     geolocationControl.location();
//     geolocationControl.addEventListener("locationSuccess", function(e){// 定位成功事件
//         var address = '';
//         address += e.addressComponent.province;
//         address += e.addressComponent.city;
//         address += e.addressComponent.district;
//         address += e.addressComponent.street;
//         address += e.addressComponent.streetNumber;
//         document.getElementById("my_pos").innerHTML = "您的位置是：" + address;
//         var pt = new BMap.Point(e.point.lng, e.point.lat)
//         // var pt = new BMap.Point(30.87634827797537, 120.12831498812857)
// 	    map.centerAndZoom(pt, 15);
//     });

//     geolocationControl.addEventListener("locationError",function(e){// 定位失败事件
//         document.getElementById("my_pos").innerHTML = e.message;
//     });

//     map.addControl(geolocationControl);
//     var markers = [
//     {name:'梦圆大酒店综合服务点',pos:[120.268492,30.842549],dis:'吴兴区',add:'湖州市织里南路2号',tel:'15268292116',},
//     {name:'梦幻森林大酒店综合服务点',pos:[120.258921,30.876646],dis:'吴兴区',add:'湖州市织里镇珍贝路118号',tel:'15868222203'},
//     {name:'皇冠商务酒店综合服务点',pos:[120.131164,30.890578],dis:'吴兴区',add:'湖州市二环北路139号',tel:'0572-2608005',},
//     {name:'江南庭院酒店综合服务点',pos:[120.439914,30.878508],dis:'南浔区',add:'南浔镇群乐路188号',tel:'0572-3651999/15695728920',},
//     {name:'莫干山大酒店综合服务点',pos:[119.966277,30.540717],dis:'德清县',add:'德清县武康街道永安街25号',tel:'13567296558',},
//     {name:'七彩假日宾馆（德清六店）综合服务点',pos:[119.980248,30.537087],dis:'德清县',add:'德清县武康街道曲园南路200号',tel:'13867295669',},
//     {name:'格林豪泰大酒店综合服务点',pos:[119.931905,31.030948],dis:'长兴区',add:'长兴县长城路929号',tel:'13757252566',},
//     {name:'瑞吉综合服务点',pos:[119.687233,30.632991],dis:'安吉县',add:'昌硕街道迎宾大道607号',tel:'0572-5310197',},
//     {name:'湖州开元美途酒店（重点地区）综合服务点',pos:[120.067361,30.867172],dis:'南太湖新区',add:'西塞山路819号成业智能中心C座',tel:'0572-2203000',},
    
//     {name:'嘉兴市南湖饭店综合服务点',pos:[120.862106,30.374932],dis:'南湖区',add:'环城东路81号',tel:'13905737026',},
//     {name:'江建酒店综合服务点',pos:[120.76986,30.81289],dis:'秀洲区',add:'嘉兴市秀洲区油车港镇天星西路118号',tel:'13484110102',},
//     {name:'华展大酒店综合服务点',pos:[120.922078,30.839949],dis:'嘉善县',add:'嘉善县罗星街道晋阳西路271号',tel:'17855839649',},
//     {name:'平湖富丽雅大酒店综合服务点',pos:[121.006225,30.714247],dis:'平湖区',add:'钟埭街道环北二路985号',tel:'13758356923/0573-850943333',},
//     {name:'海盐县综合服务点',pos:[120.940843,30.523819],dis:'海盐县',add:'海盐县武原街道百尺北路8号新天地广场大酒店',tel:'0573-86051100',},
//     {name:'许村镇综合服务点',pos:[120.395558,30.487326],dis:'海宁市',add:'许村镇联盟村家纺产业园汉珂公司旁边',tel:'13758349026',},
//     {name:'长安镇（高新区）综合服务点',pos:[120.419575,30.389213],dis:'海宁市',add:'海宁市长安镇高新区凤翔路6号',tel:'15850606004/17621752471',},
//     {name:'周王庙镇综合服务点',pos:[120.505396,30.460964],dis:'海宁市',add:'海宁市周王庙镇联民村蔡家石桥30号（原镇敬老院）',tel:'13967337605',},
//     {name:'盐官镇综合服务点',pos:[120.566987,30.446402],dis:'海宁市',add:'海宁市乡村振兴学院内桃园村桃园宾馆',tel:'18268407079',},
//     {name:'斜桥镇综合服务点',pos:[120.624446,30.501253],dis:'海宁市',add:'海宁市斜桥镇洛塘街31号（原老庆云卫生院）',tel:'13706591737',},
//     {name:'丁桥镇综合服务点',pos:[120.680989,30.454609],dis:'海宁市',add:'海宁市丁桥镇镇保路22号（瑞麒酒店海宁店7楼）',tel:'13511310671',},
//     {name:'袁花镇综合服务点',pos:[120.778715,30.426596],dis:'海宁市',add:'海宁市袁花镇联红路65号两创园区职工宿舍',tel:'13857333573',},
//     {name:'尖山新区（黄湾镇）综合服务点',pos:[120.792082,30.34202],dis:'海宁市',add:'钱塘江路综治中心西侧过渡房',tel:'13586478369',},
//     {name:'硖石街道综合服务点',pos:[120.718884,30.525224],dis:'海宁市',add:'海宁市硖石街道塘南东路710号陌上花酒店',tel:'13967335559',},
//     {name:'海洲街道综合服务点',pos:[120.673972,30.522152],dis:'海宁市',add:'海宁市海洲街道联合路417号人间四月天宾馆',tel:'13819316818',},
//     {name:'经济开发区（海昌街道）综合服务点',pos:[120.73703,30.5386],dis:'海宁市',add:'海宁市施带路18号大众皮业宿舍',tel:'13511357363',},
//     {name:'马桥街道综合服务点',pos:[120.701471,30.465353],dis:'海宁市',add:'海宁市马桥街道红旗路102号潮荣宾馆',tel:'13586303760',},
//     {name:'和平饭店综合服务点',pos:[120.53837,30.612965],dis:'桐乡市',add:'桐乡市梧桐街道复兴南路108号',tel:'18358354512',},
//     {name:'吉辰酒店综合服务点',pos:[120.554681,30.653106],dis:'桐乡市',add:'桐乡市梧桐街道环城北路851号',tel:'13645730860',},
//     {name:'灵安商务宾馆综合服务点',pos:[120.522346,30.587527],dis:'桐乡市',add:'桐乡市凤鸣街道灵安路376号',tel:'13736816776',},
//     {name:'嘉悦酒店综合服务点',pos:[120.602599,30.673485],dis:'桐乡市',add:'桐乡市濮院镇凯旋路1950号',tel:'15068325358',},
//     {name:'华隆宾馆综合服务点',pos:[120.425736,30.525144],dis:'桐乡市',add:'桐乡市崇福镇崇德西路158号',tel:'13705839986/13819416660',},
//     {name:'金剑商务宾馆综合服务点',pos:[120.363936,30.575482],dis:'桐乡市',add:'桐乡市河山镇世纪新路小商品市场',tel:'15857330031',},
//     {name:'红慧宾馆综合服务点',pos:[120.372835,30.638845],dis:'桐乡市',add:'桐乡市河山镇世纪新路小商品市场',tel:'15888393070',},
//     {name:'冠峰大酒店综合服务点',pos:[120.515596,30.694022],dis:'桐乡市',add:'桐乡市乌镇镇龙翔大道与湖盐公路交叉路口往西50米',tel:'13736800839',},
//     {name:'群星宾馆综合服务点',pos:[120.45132,30.62997],dis:'桐乡市',add:'桐乡市石门镇中兴北路122号',tel:'15868343388',},
//     {name:'全季酒店综合服务点',pos:[120.845042,30.737054],dis:'嘉兴经开区',add:'嘉兴市南湖区由拳路2491号',tel:'13705835539',},
//     {name:'胜高酒店综合服务点（嘉兴汽车北站店）',pos:[120.751537,30.792697],dis:'嘉兴经开区',add:'嘉兴市秀洲区禾兴北路826号',tel:'13586452313',},
//     {name:'星程酒店综合服务点',pos:[121.086494,30.610006],dis:'嘉兴港区',add:'乍浦镇乍王路516号',tel:'13511332573',},
    
//     {name:'企业复工集中服务点(三江)',pos:[120.648317,30.103181],dis:'越城区',add:'斗门街道三江路78号原飞泰光电厂区',tel:'13735378268/18989559508',},
//     {name:'若航综合服务点',pos:[120.495019,30.038048],dis:'柯桥区',add:'柯岩街道南闲路185号',tel:'13616758883',},
//     {name:'上虞瑞曼尼智慧酒店综合服务点',pos:[120.903385,30.045462],dis:'上虞区',add:'上虞区迎宾大道771号',tel:'13858587053',},
//     {name:'宏宇浣江医院综合服务点',pos:[120.252356,29.690942],dis:'诸暨市',add:'暨南街道三江新村',tel:'13858506853',},
//     {name:'嵊州市民兵训练基地综合服务点',pos:[120.80293,29.591564],dis:'嵊州市',add:'嵊州市鹿山街道求是路',tel:'18858531009',},
//     {name:'新昌县委党校综合服务点',pos:[120.874732,29.484944],dis:'新昌县',add:'新昌县七星街道元岙村160号',tel:'13857530026',},
    
//     {name:'六合大酒店服务点',pos:[119.62134,29.10312],dis:'婺城区',add:'婺城区长湖路133号',tel:'0579-89809837',},
//     {name:'多湖亚美综合服务点',pos:[119.713373,29.099481],dis:'金东区',add:'金东区康济南街555号',tel:'13566787897',},
//     {name:'孝顺满塘综合服务点',pos:[119.872688,29.191895],dis:'金东区',add:'金东区孝顺镇金山大道128号',tel:'13806786123',},
//     {name:'国际大酒店综合服务点',pos:[119.44428,29.216034],dis:'兰溪市',add:'兰溪市振兴路333号',tel:'0579-88966968',},
//     {name:'人民医院综合服务点',pos:[119.432424,29.212869],dis:'兰溪市',add:'兰溪市西山路1359号',tel:'0579-88669676',},
//     {name:'东贸大酒店综合服务点',pos:[120.252526,29.300833],dis:'东阳市',add:'东阳市广福东街30号',tel:'18266983881',},
//     {name:'假日酒店综合服务点',pos:[120.071766,29.307186],dis:'义乌市',add:'义乌市城中西路200号',tel:'0579-85233888',},
//     {name:'玺悦酒店综合服务点',pos:[120.093172,29.317516],dis:'义乌市',add:'义乌市稠州北路336号',tel:'0579-89901100',},
//     {name:'名岛酒店综合服务点',pos:[120.072724,29.300997],dis:'义乌市',add:'义乌市稠州西路43号',tel:'0579-85017999',},
//     {name:'百亨酒店综合服务点',pos:[120.114348,29.350498],dis:'义乌市',add:'义乌市银海一区19幢',tel:'0579-85853399',},
//     {name:'怡嘉风尚酒店综合服务点',pos:[120.1003,29.325807],dis:'义乌市',add:'义乌市稠州北路571号',tel:'0579-85896666',},
//     {name:'菲米诺克酒店综合服务点',pos:[120.074007,29.302078],dis:'义乌市',add:'义乌市稠州西路66号',tel:'0579-89968999',},
//     {name:'朋莱商务宾馆综合服务点',pos:[120.10939,29.340065],dis:'义乌市',add:'义乌市福田一区21幢8号',tel:'0579-85596777',},
//     {name:'简爱爱丰酒店综合服务点',pos:[120.096025,29.326777],dis:'义乌市',add:'义乌市工人北路285号',tel:'0579-85589999',},
//     {name:'海德宾馆综合服务点',pos:[120.10762,29.310093],dis:'义乌市',add:'义乌市江东中路五爱新村1栋',tel:'0579-83581111',},
//     {name:'党校综合服务点',pos:[120.069945,28.889388],dis:'永康市',add:'永康市金都路1号',tel:'0579-87219075',},
//     {name:'老福利院综合服务点',pos:[120.033524,28.881184],dis:'新昌县',add:'永康市龙福路118号',tel:'0579-87172340',},
//     {name:'塔山宾馆综合服务点',pos:[119.902203,29.460224],dis:'浦江县',add:'浦江县环城东路59号',tel:'0579-89395056',},
//     {name:'北岭山庄综合服务点',pos:[119.816011,28.904814],dis:'武义县',add:'武义县环城北路57号（原党校宾馆）',tel:'0579-87660000',},
//     {name:'花台山宾馆综合服务点',pos:[120.450459,29.060333],dis:'磐安县',add:'磐安县安文街道海螺街36号',tel:'17357952705',},
//     {name:'金华尊御酒店综合服务点',pos:[119.669202,29.070784],dis:'金华开发区',add:'婺城区和信路398号',tel:'19884896819/17280963710',},
  
//     {name:'安和大酒店综合服务点',pos:[118.816136,28.979432],dis:'柯城区',add:'柯城区姜家山乡西池塘头村农特产交易中心12区3-4楼',tel:'13157051371',},
//     {name:'圣效大酒店综合服务点',pos:[118.936889,28.965191],dis:'衢江区',add:'衢江区大桥路38号',tel:'13625709818',},
//     {name:'宜尚酒店综合服务点',pos:[119.193455,29.088928],dis:'龙游县',add:'龙游县城北开发区金星大道11号',tel:'13867031088',},
//     {name:'龙游县委党校综合服务点',pos:[119.214801,29.052611],dis:'龙游县',add:'龙游县东华街道项家村(龙游县第二高级中学西北侧约50米)',tel:'13567031516',},
//     {name:'龙游速八宾馆综合服务点',pos:[119.182667,29.051136],dis:'龙游县',add:'龙游县龙洲街道平政路银泰龙庭57幢',tel:'13676602190',},
//     {name:'世外桃源酒店综合服务点',pos:[118.640309,28.763255],dis:'江山市',add:'江山市双塔街道礼贤路1号',tel:'13675702175/13626709192',},
//     {name:'常山县委党校综合服务点',pos:[118.491767,28.917124],dis:'常山县',add:'常山县金川街道龙溪路56号',tel:'13567076620',},
//     {name:'雷迪森酒店综合服务点',pos:[118.402403,29.076433],dis:'开化县',add:'开化县华埠镇独山村泉塘路5号易云电子商务创业园19幢',tel:'18305033521',},
//     {name:'开化县民兵营服务点',pos:[118.415713,29.114401],dis:'开化县',add:'开化县205国道（贝林星月湾大门正对面）',tel:'19884896819/17280963710',},
//     {name:'原8090酒店综合服务点',pos:[118.886682,28.95475],dis:'集聚区',add:'柯城区衢化路288号',tel:'13967015319',},

//     {name:'金鹰大酒店综合服务点',pos:[122.062968,30.014673],dis:'定海区',add:'舟山市定海区盐仓街道兴舟大道以北(鸭蛋山码头旁)',tel:'13567650696',},
//     {name:'格林豪泰东港店综合服务点',pos:[122.062968,30.014673],dis:'普陀区',add:'舟山市普陀区东港街道宁兴街132-1号',tel:'13857202220',},
//     {name:'六横千荷大酒店综合服务点',pos:[122.206873,29.707008],dis:'普陀区',add:'舟山市普陀区六横镇客运路18号附近',tel:'13567650352',},
//     {name:'秀山宾馆综合服务点',pos:[122.176428,30.190604],dis:'岱山县',add:'岱山县秀山乡兰秀路173号',tel:'13567660030/18857093237',},
//     {name:'洋山开发建设管理服务中心大楼综合服务点',pos:[122.140816,30.606919],dis:'嵊泗县',add:'嵊泗县沈家湾客运码头',tel:'13587097103',},
//     {name:'嵊泗县委党校综合服务点',pos:[122.474284,30.719646],dis:'嵊泗县',add:'嵊泗县基湖村兴基路25号',tel:'13967232977',},
//     {name:'舟山元森花园酒店综合服务点',pos:[122.155457,30.009881],dis:'新城管委会',add:'舟山市定海区兴东路6号',tel:'2559999',},
//     {name:'海岛阳光酒店综合服务点',pos:[122.408295,29.896081],dis:'普朱管委会',add:'朱家尖金沙大道60号',tel:'13957227020',},
//     {name:'普陀山梅岑苑酒店综合服务点',pos:[122.387406,29.987827],dis:'普朱管委会',add:'普陀山梅岑路86号',tel:'13868240015',},

//     {name:'佰仕代酒店综合服务点',pos:[121.432002,28.681044],dis:'椒江区',add:'椒江区白云街道中山西路371号',tel:'0576-88829999/13777683696',},
//     {name:'白玉兰酒店综合服务点',pos:[121.431842,28.675216],dis:'椒江区',add:'椒江区白云街道云西路155-18号',tel:'0576-88838820-0/13777683696',},
//     {name:'动车站综合服务点',pos:[121.296612,28.691911],dis:'黄岩区',add:'黄岩区北城街道站前大道台州动车站内',tel:'13676672229',},
//     {name:'和庭综合服务点',pos:[121.34269,28.591496],dis:'路桥区',add:'路桥桐屿街道桐杨路勤丰大厦西侧',tel:'0576-89281888',},
//     {name:'牛头山度假村综合服务点',pos:[121.327783,28.858298],dis:'临海市',add:'临海市牛头山水库南侧近牛头山旅游区',tel:'13586095112',},
//     {name:'久天商务酒店综合服务点',pos:[121.15585,28.866311],dis:'临海市',add:'大洋街道东方大道28号',tel:'13758685883',},
//     {name:'银星宾馆综合服务点',pos:[121.052065,29.136552],dis:'天台县',add:'赤城街道人民东路559号',tel:'13586236963',},
//     {name:'东方嘉元酒店综合服务点',pos:[120.756666,28.864792],dis:'仙居县',add:'仙居县福应街道陵园路13号',tel:'0576-87833208',},
//     {name:'火电综合服务点',pos:[121.684963,29.017939],dis:'三门县',add:'三门县浦坝港镇草头村',tel:'13968518581',},
//     {name:'金茂商务酒店综合服务点',pos:[121.384657,28.388407],dis:'温岭市',add:'温岭市太平街道锦屏路436号',tel:'0576-86528888',},
//     {name:'环球一号酒店综合服务点',pos:[121.37059,28.393079],dis:'温岭市',add:'中华北路623号',tel:'0576-81766615',},
//     {name:'老二医综合服务点',pos:[121.306319,28.221969],dis:'玉环市',add:'玉环市楚门镇环城北路68号（楚门卫生院住院部后门）',tel:'15958686566',},
//     {name:'蒲公英酒店综合服务点',pos:[121.245651,28.116125],dis:'玉环市',add:'玉环市双港路223号(近欧洲花园) ' ,tel:'18957678091',},
//     {name:'民乐商旅酒店综合服务点',pos:[121.536422,28.599051],dis:'台州湾集聚区',add:'椒江区三甲街道滨富东路2号',tel:'0576-89899911',},


//     {name:'侨家大院综合服务点',pos:[120.307326,28.126889],dis:'青田县',add:'青田县石郭工业园区9幢',tel:'13695778969',},
//     {name:'华尔顿综合服务点',pos:[120.306242,28.126805],dis:'青田县',add:'青田县石郭工业园区B1',tel:'13575360468',},
//     {name:'养老中心十三医学观察点',pos:[120.30784,28.127774],dis:'青田县',add:'青田县石郭下村8号',tel:'13857090098',},
//     {name:'汇瓯综合服务点',pos:[120.30585,28.127393],dis:'青田县',add:'青田瓯南街道石郭工业园区石郭下村8号',tel:'13575360468',},
//     {name:'残疾人托养中心综合服务点',pos:[118.98464,27.612168],dis:'庆元县',add:'庆元大道八都隧道东侧出口',tel:'13757865201/13587155750',},
//     {name:'畲乡之星时尚酒店综合服务点',pos:[119.643501,27.993456],dis:'景宁县',add:'景宁县人民北路新田小区B栋10幢5678号',tel:'13906789299',},
//     {name:'中共丽水市委党校综合服务点',pos:[119.890123,28.491409],dis:'莲都区',add:'丽水市莲都区联城街道凌云街261号',tel:'0578-2296599',},
//     {name:'龙泉市香溢综合服务点',pos:[119.143717,28.07879],dis:'龙泉市',add:'龙泉市贤良路218号',tel:'0578-7217180',},
//     {name:'竹炭博物馆综合服务点',pos:[119.318111,28.626673],dis:'遂昌县',add:'遂昌县妙高街道炭缘路1号',tel:'0578-8521113',},
//     {name:'缙云县东渡党校综合服务点',pos:[120.065231,28.634072],dis:'缙云县',add:'缙云县五云街道状元村校场路2号',tel:'13905889584',},
//     {name:'云和嘉瑞君亭酒店综合服务点',pos:[119.614256,28.136601],dis:'云和县',add:'浙江省丽水市云和县元和街道养生文化村1号',tel:'13967040386',},
//     {name:'松阳县天元国际酒店综合服务点',pos:[119.506485,28.450266],dis:'松阳县',add:'长虹东路183号',tel:'13906887757',},

  
// ]
//     for (var i=0; i<markers.length; i++){
//         // console.log(item.pos[0],item.pos[1])
//         (function(x){
//             var m = new BMap.Marker(new BMap.Point(markers[x].pos[0],markers[x].pos[1]));
//             var opts = {
//                 width : 150,     // 信息窗口宽度
//                 height: 100,     // 信息窗口高度
//                 title : markers[x].name, // 信息窗口标题
//             }  
//             var infoWindow = new BMap.InfoWindow(`地址:${markers[x].add}<br/>电话:${markers[x].tel}`,opts);  // 创建信息窗口对象 
// 		    m.addEventListener("click", function(){    
//                     map.openInfoWindow(infoWindow, new BMap.Point(markers[x].pos[0],markers[x].pos[1])); //开启信息窗口
//             }); 
//             map.addOverlay(m)
//         })(i);    
//     }
// $.ajax({
//     url: "/high_risk",
//     type: "GET",
//     dataType: "json",
//     success: function (data) {
//         console.log(data)
//     }
//     })

var _markers = [
    {
    city_type:"湖州市",
    data:
    [{name:'梦圆大酒店综合服务点',pos:[120.268492,30.842549],dis:'湖州市吴兴区',add:'湖州市织里南路2号',tel:'15268292116',},
    {name:'梦幻森林大酒店综合服务点',pos:[120.258921,30.876646],dis:'湖州市吴兴区',add:'湖州市织里镇珍贝路118号',tel:'15868222203'},
    {name:'皇冠商务酒店综合服务点',pos:[120.131164,30.890578],dis:'湖州市吴兴区',add:'湖州市二环北路139号',tel:'0572-2608005',},
    {name:'江南庭院酒店综合服务点',pos:[120.439914,30.878508],dis:'湖州市南浔区',add:'南浔镇群乐路188号',tel:'0572-3651999/15695728920',},
    {name:'莫干山大酒店综合服务点',pos:[119.966277,30.540717],dis:'湖州市德清县',add:'德清县武康街道永安街25号',tel:'13567296558',},
    {name:'七彩假日宾馆（德清六店）综合服务点',pos:[119.980248,30.537087],dis:'湖州市德清县',add:'德清县武康街道曲园南路200号',tel:'13867295669',},
    {name:'格林豪泰大酒店综合服务点',pos:[119.931905,31.030948],dis:'湖州市长兴区',add:'长兴县长城路929号',tel:'13757252566',},
    {name:'瑞吉综合服务点',pos:[119.687233,30.632991],dis:'湖州市安吉县',add:'昌硕街道迎宾大道607号',tel:'0572-5310197',},
    {name:'湖州开元美途酒店（重点地区）综合服务点',pos:[120.067361,30.867172],dis:'湖州市南太湖新区',add:'西塞山路819号成业智能中心C座',tel:'0572-2203000',},
    ]
    },
    {
    city_type:"嘉兴市",
    data:
    [{name:'嘉兴市南湖饭店综合服务点',pos:[120.862106,30.374932],dis:'南湖区',add:'环城东路81号',tel:'13905737026',},
    {name:'江建酒店综合服务点',pos:[120.76986,30.81289],dis:'秀洲区',add:'嘉兴市秀洲区油车港镇天星西路118号',tel:'13484110102',},
    {name:'华展大酒店综合服务点',pos:[120.922078,30.839949],dis:'嘉善县',add:'嘉善县罗星街道晋阳西路271号',tel:'17855839649',},
    {name:'平湖富丽雅大酒店综合服务点',pos:[121.006225,30.714247],dis:'平湖区',add:'钟埭街道环北二路985号',tel:'13758356923/0573-850943333',},
    {name:'海盐县综合服务点',pos:[120.940843,30.523819],dis:'海盐县',add:'海盐县武原街道百尺北路8号新天地广场大酒店',tel:'0573-86051100',},
    {name:'许村镇综合服务点',pos:[120.395558,30.487326],dis:'海宁市',add:'许村镇联盟村家纺产业园汉珂公司旁边',tel:'13758349026',},
    {name:'长安镇（高新区）综合服务点',pos:[120.419575,30.389213],dis:'海宁市',add:'海宁市长安镇高新区凤翔路6号',tel:'15850606004/17621752471',},
    {name:'周王庙镇综合服务点',pos:[120.505396,30.460964],dis:'海宁市',add:'海宁市周王庙镇联民村蔡家石桥30号（原镇敬老院）',tel:'13967337605',},
    {name:'盐官镇综合服务点',pos:[120.566987,30.446402],dis:'海宁市',add:'海宁市乡村振兴学院内桃园村桃园宾馆',tel:'18268407079',},
    {name:'斜桥镇综合服务点',pos:[120.624446,30.501253],dis:'海宁市',add:'海宁市斜桥镇洛塘街31号（原老庆云卫生院）',tel:'13706591737',},
    {name:'丁桥镇综合服务点',pos:[120.680989,30.454609],dis:'海宁市',add:'海宁市丁桥镇镇保路22号（瑞麒酒店海宁店7楼）',tel:'13511310671',},
    {name:'袁花镇综合服务点',pos:[120.778715,30.426596],dis:'海宁市',add:'海宁市袁花镇联红路65号两创园区职工宿舍',tel:'13857333573',},
    {name:'尖山新区（黄湾镇）综合服务点',pos:[120.792082,30.34202],dis:'海宁市',add:'钱塘江路综治中心西侧过渡房',tel:'13586478369',},
    {name:'硖石街道综合服务点',pos:[120.718884,30.525224],dis:'海宁市',add:'海宁市硖石街道塘南东路710号陌上花酒店',tel:'13967335559',},
    {name:'海洲街道综合服务点',pos:[120.673972,30.522152],dis:'海宁市',add:'海宁市海洲街道联合路417号人间四月天宾馆',tel:'13819316818',},
    {name:'经济开发区（海昌街道）综合服务点',pos:[120.73703,30.5386],dis:'海宁市',add:'海宁市施带路18号大众皮业宿舍',tel:'13511357363',},
    {name:'马桥街道综合服务点',pos:[120.701471,30.465353],dis:'海宁市',add:'海宁市马桥街道红旗路102号潮荣宾馆',tel:'13586303760',},
    {name:'和平饭店综合服务点',pos:[120.53837,30.612965],dis:'桐乡市',add:'桐乡市梧桐街道复兴南路108号',tel:'18358354512',},
    {name:'吉辰酒店综合服务点',pos:[120.554681,30.653106],dis:'桐乡市',add:'桐乡市梧桐街道环城北路851号',tel:'13645730860',},
    {name:'灵安商务宾馆综合服务点',pos:[120.522346,30.587527],dis:'桐乡市',add:'桐乡市凤鸣街道灵安路376号',tel:'13736816776',},
    {name:'嘉悦酒店综合服务点',pos:[120.602599,30.673485],dis:'桐乡市',add:'桐乡市濮院镇凯旋路1950号',tel:'15068325358',},
    {name:'华隆宾馆综合服务点',pos:[120.425736,30.525144],dis:'桐乡市',add:'桐乡市崇福镇崇德西路158号',tel:'13705839986/13819416660',},
    {name:'金剑商务宾馆综合服务点',pos:[120.363936,30.575482],dis:'桐乡市',add:'桐乡市河山镇世纪新路小商品市场',tel:'15857330031',},
    {name:'红慧宾馆综合服务点',pos:[120.372835,30.638845],dis:'桐乡市',add:'桐乡市河山镇世纪新路小商品市场',tel:'15888393070',},
    {name:'冠峰大酒店综合服务点',pos:[120.515596,30.694022],dis:'桐乡市',add:'桐乡市乌镇镇龙翔大道与湖盐公路交叉路口往西50米',tel:'13736800839',},
    {name:'群星宾馆综合服务点',pos:[120.45132,30.62997],dis:'桐乡市',add:'桐乡市石门镇中兴北路122号',tel:'15868343388',},
    {name:'全季酒店综合服务点',pos:[120.845042,30.737054],dis:'嘉兴经开区',add:'嘉兴市南湖区由拳路2491号',tel:'13705835539',},
    {name:'胜高酒店综合服务点（嘉兴汽车北站店）',pos:[120.751537,30.792697],dis:'嘉兴经开区',add:'嘉兴市秀洲区禾兴北路826号',tel:'13586452313',},
    {name:'星程酒店综合服务点',pos:[121.086494,30.610006],dis:'嘉兴港区',add:'乍浦镇乍王路516号',tel:'13511332573',},]
    },
    {
    city_type:"绍兴市",
    data:
    [{name:'企业复工集中服务点(三江)',pos:[120.648317,30.103181],dis:'越城区',add:'斗门街道三江路78号原飞泰光电厂区',tel:'13735378268/18989559508',},
    {name:'若航综合服务点',pos:[120.495019,30.038048],dis:'柯桥区',add:'柯岩街道南闲路185号',tel:'13616758883',},
    {name:'上虞瑞曼尼智慧酒店综合服务点',pos:[120.903385,30.045462],dis:'上虞区',add:'上虞区迎宾大道771号',tel:'13858587053',},
    {name:'宏宇浣江医院综合服务点',pos:[120.252356,29.690942],dis:'诸暨市',add:'暨南街道三江新村',tel:'13858506853',},
    {name:'嵊州市民兵训练基地综合服务点',pos:[120.80293,29.591564],dis:'嵊州市',add:'嵊州市鹿山街道求是路',tel:'18858531009',},
    {name:'新昌县委党校综合服务点',pos:[120.874732,29.484944],dis:'新昌县',add:'新昌县七星街道元岙村160号',tel:'13857530026',},]
    },
    {
    city_type:"宁波市",
    data:
    [{name:'六合大酒店服务点',pos:[119.62134,29.10312],dis:'婺城区',add:'婺城区长湖路133号',tel:'0579-89809837',},
    {name:'多湖亚美综合服务点',pos:[119.713373,29.099481],dis:'金东区',add:'金东区康济南街555号',tel:'13566787897',},
    {name:'孝顺满塘综合服务点',pos:[119.872688,29.191895],dis:'金东区',add:'金东区孝顺镇金山大道128号',tel:'13806786123',},
    {name:'国际大酒店综合服务点',pos:[119.44428,29.216034],dis:'兰溪市',add:'兰溪市振兴路333号',tel:'0579-88966968',},
    {name:'人民医院综合服务点',pos:[119.432424,29.212869],dis:'兰溪市',add:'兰溪市西山路1359号',tel:'0579-88669676',},
    {name:'东贸大酒店综合服务点',pos:[120.252526,29.300833],dis:'东阳市',add:'东阳市广福东街30号',tel:'18266983881',},
    {name:'假日酒店综合服务点',pos:[120.071766,29.307186],dis:'义乌市',add:'义乌市城中西路200号',tel:'0579-85233888',},
    {name:'玺悦酒店综合服务点',pos:[120.093172,29.317516],dis:'义乌市',add:'义乌市稠州北路336号',tel:'0579-89901100',},
    {name:'名岛酒店综合服务点',pos:[120.072724,29.300997],dis:'义乌市',add:'义乌市稠州西路43号',tel:'0579-85017999',},
    {name:'百亨酒店综合服务点',pos:[120.114348,29.350498],dis:'义乌市',add:'义乌市银海一区19幢',tel:'0579-85853399',},
    {name:'怡嘉风尚酒店综合服务点',pos:[120.1003,29.325807],dis:'义乌市',add:'义乌市稠州北路571号',tel:'0579-85896666',},
    {name:'菲米诺克酒店综合服务点',pos:[120.074007,29.302078],dis:'义乌市',add:'义乌市稠州西路66号',tel:'0579-89968999',},
    {name:'朋莱商务宾馆综合服务点',pos:[120.10939,29.340065],dis:'义乌市',add:'义乌市福田一区21幢8号',tel:'0579-85596777',},
    {name:'简爱爱丰酒店综合服务点',pos:[120.096025,29.326777],dis:'义乌市',add:'义乌市工人北路285号',tel:'0579-85589999',},
    {name:'海德宾馆综合服务点',pos:[120.10762,29.310093],dis:'义乌市',add:'义乌市江东中路五爱新村1栋',tel:'0579-83581111',},
    {name:'党校综合服务点',pos:[120.069945,28.889388],dis:'永康市',add:'永康市金都路1号',tel:'0579-87219075',},
    {name:'老福利院综合服务点',pos:[120.033524,28.881184],dis:'新昌县',add:'永康市龙福路118号',tel:'0579-87172340',},
    {name:'塔山宾馆综合服务点',pos:[119.902203,29.460224],dis:'浦江县',add:'浦江县环城东路59号',tel:'0579-89395056',},
    {name:'北岭山庄综合服务点',pos:[119.816011,28.904814],dis:'武义县',add:'武义县环城北路57号（原党校宾馆）',tel:'0579-87660000',},
    {name:'花台山宾馆综合服务点',pos:[120.450459,29.060333],dis:'磐安县',add:'磐安县安文街道海螺街36号',tel:'17357952705',},
    {name:'金华尊御酒店综合服务点',pos:[119.669202,29.070784],dis:'金华开发区',add:'婺城区和信路398号',tel:'19884896819/17280963710',},]
    },
    {
    city_type:"衢州市",
    data:
    [{name:'安和大酒店综合服务点',pos:[118.816136,28.979432],dis:'柯城区',add:'柯城区姜家山乡西池塘头村农特产交易中心12区3-4楼',tel:'13157051371',},
    {name:'圣效大酒店综合服务点',pos:[118.936889,28.965191],dis:'衢江区',add:'衢江区大桥路38号',tel:'13625709818',},
    {name:'宜尚酒店综合服务点',pos:[119.193455,29.088928],dis:'龙游县',add:'龙游县城北开发区金星大道11号',tel:'13867031088',},
    {name:'龙游县委党校综合服务点',pos:[119.214801,29.052611],dis:'龙游县',add:'龙游县东华街道项家村(龙游县第二高级中学西北侧约50米)',tel:'13567031516',},
    {name:'龙游速八宾馆综合服务点',pos:[119.182667,29.051136],dis:'龙游县',add:'龙游县龙洲街道平政路银泰龙庭57幢',tel:'13676602190',},
    {name:'世外桃源酒店综合服务点',pos:[118.640309,28.763255],dis:'江山市',add:'江山市双塔街道礼贤路1号',tel:'13675702175/13626709192',},
    {name:'常山县委党校综合服务点',pos:[118.491767,28.917124],dis:'常山县',add:'常山县金川街道龙溪路56号',tel:'13567076620',},
    {name:'雷迪森酒店综合服务点',pos:[118.402403,29.076433],dis:'开化县',add:'开化县华埠镇独山村泉塘路5号易云电子商务创业园19幢',tel:'18305033521',},
    {name:'开化县民兵营服务点',pos:[118.415713,29.114401],dis:'开化县',add:'开化县205国道（贝林星月湾大门正对面）',tel:'19884896819/17280963710',},
    {name:'原8090酒店综合服务点',pos:[118.886682,28.95475],dis:'集聚区',add:'柯城区衢化路288号',tel:'13967015319',},]
    },
    {
    city_type:"舟山市",
    data:
    [{name:'金鹰大酒店综合服务点',pos:[122.062968,30.014673],dis:'定海区',add:'舟山市定海区盐仓街道兴舟大道以北(鸭蛋山码头旁)',tel:'13567650696',},
    {name:'格林豪泰东港店综合服务点',pos:[122.062968,30.014673],dis:'普陀区',add:'舟山市普陀区东港街道宁兴街132-1号',tel:'13857202220',},
    {name:'六横千荷大酒店综合服务点',pos:[122.206873,29.707008],dis:'普陀区',add:'舟山市普陀区六横镇客运路18号附近',tel:'13567650352',},
    {name:'秀山宾馆综合服务点',pos:[122.176428,30.190604],dis:'岱山县',add:'岱山县秀山乡兰秀路173号',tel:'13567660030/18857093237',},
    {name:'洋山开发建设管理服务中心大楼综合服务点',pos:[122.140816,30.606919],dis:'嵊泗县',add:'嵊泗县沈家湾客运码头',tel:'13587097103',},
    {name:'嵊泗县委党校综合服务点',pos:[122.474284,30.719646],dis:'嵊泗县',add:'嵊泗县基湖村兴基路25号',tel:'13967232977',},
    {name:'舟山元森花园酒店综合服务点',pos:[122.155457,30.009881],dis:'新城管委会',add:'舟山市定海区兴东路6号',tel:'2559999',},
    {name:'海岛阳光酒店综合服务点',pos:[122.408295,29.896081],dis:'普朱管委会',add:'朱家尖金沙大道60号',tel:'13957227020',},
    {name:'普陀山梅岑苑酒店综合服务点',pos:[122.387406,29.987827],dis:'普朱管委会',add:'普陀山梅岑路86号',tel:'13868240015',},]
    },
    {
    city_type:"台州市",
    data:
    [{name:'佰仕代酒店综合服务点',pos:[121.432002,28.681044],dis:'椒江区',add:'椒江区白云街道中山西路371号',tel:'0576-88829999/13777683696',},
    {name:'白玉兰酒店综合服务点',pos:[121.431842,28.675216],dis:'椒江区',add:'椒江区白云街道云西路155-18号',tel:'0576-88838820-0/13777683696',},
    {name:'动车站综合服务点',pos:[121.296612,28.691911],dis:'黄岩区',add:'黄岩区北城街道站前大道台州动车站内',tel:'13676672229',},
    {name:'和庭综合服务点',pos:[121.34269,28.591496],dis:'路桥区',add:'路桥桐屿街道桐杨路勤丰大厦西侧',tel:'0576-89281888',},
    {name:'牛头山度假村综合服务点',pos:[121.327783,28.858298],dis:'临海市',add:'临海市牛头山水库南侧近牛头山旅游区',tel:'13586095112',},
    {name:'久天商务酒店综合服务点',pos:[121.15585,28.866311],dis:'临海市',add:'大洋街道东方大道28号',tel:'13758685883',},
    {name:'银星宾馆综合服务点',pos:[121.052065,29.136552],dis:'天台县',add:'赤城街道人民东路559号',tel:'13586236963',},
    {name:'东方嘉元酒店综合服务点',pos:[120.756666,28.864792],dis:'仙居县',add:'仙居县福应街道陵园路13号',tel:'0576-87833208',},
    {name:'火电综合服务点',pos:[121.684963,29.017939],dis:'三门县',add:'三门县浦坝港镇草头村',tel:'13968518581',},
    {name:'金茂商务酒店综合服务点',pos:[121.384657,28.388407],dis:'温岭市',add:'温岭市太平街道锦屏路436号',tel:'0576-86528888',},
    {name:'环球一号酒店综合服务点',pos:[121.37059,28.393079],dis:'温岭市',add:'中华北路623号',tel:'0576-81766615',},
    {name:'老二医综合服务点',pos:[121.306319,28.221969],dis:'玉环市',add:'玉环市楚门镇环城北路68号（楚门卫生院住院部后门）',tel:'15958686566',},
    {name:'蒲公英酒店综合服务点',pos:[121.245651,28.116125],dis:'玉环市',add:'玉环市双港路223号(近欧洲花园) ' ,tel:'18957678091',},
    {name:'民乐商旅酒店综合服务点',pos:[121.536422,28.599051],dis:'台州湾集聚区',add:'椒江区三甲街道滨富东路2号',tel:'0576-89899911',},]
    },
    {
    city_type:"丽水市",
    data:   
    [{name:'侨家大院综合服务点',pos:[120.307326,28.126889],dis:'青田县',add:'青田县石郭工业园区9幢',tel:'13695778969',},
    {name:'华尔顿综合服务点',pos:[120.306242,28.126805],dis:'青田县',add:'青田县石郭工业园区B1',tel:'13575360468',},
    {name:'养老中心十三医学观察点',pos:[120.30784,28.127774],dis:'青田县',add:'青田县石郭下村8号',tel:'13857090098',},
    {name:'汇瓯综合服务点',pos:[120.30585,28.127393],dis:'青田县',add:'青田瓯南街道石郭工业园区石郭下村8号',tel:'13575360468',},
    {name:'残疾人托养中心综合服务点',pos:[118.98464,27.612168],dis:'庆元县',add:'庆元大道八都隧道东侧出口',tel:'13757865201/13587155750',},
    {name:'畲乡之星时尚酒店综合服务点',pos:[119.643501,27.993456],dis:'景宁县',add:'景宁县人民北路新田小区B栋10幢5678号',tel:'13906789299',},
    {name:'中共丽水市委党校综合服务点',pos:[119.890123,28.491409],dis:'莲都区',add:'丽水市莲都区联城街道凌云街261号',tel:'0578-2296599',},
    {name:'龙泉市香溢综合服务点',pos:[119.143717,28.07879],dis:'龙泉市',add:'龙泉市贤良路218号',tel:'0578-7217180',},
    {name:'竹炭博物馆综合服务点',pos:[119.318111,28.626673],dis:'遂昌县',add:'遂昌县妙高街道炭缘路1号',tel:'0578-8521113',},
    {name:'缙云县东渡党校综合服务点',pos:[120.065231,28.634072],dis:'缙云县',add:'缙云县五云街道状元村校场路2号',tel:'13905889584',},
    {name:'云和嘉瑞君亭酒店综合服务点',pos:[119.614256,28.136601],dis:'云和县',add:'浙江省丽水市云和县元和街道养生文化村1号',tel:'13967040386',},
    {name:'松阳县天元国际酒店综合服务点',pos:[119.506485,28.450266],dis:'松阳县',add:'长虹东路183号',tel:'13906887757',},]
    }

  
]

var map = new BMap.Map("bdmap"); // 显示地图
map.enableScrollWheelZoom(true); // 可以缩放

var geoc = new BMap.Geocoder(); 
var geolocation = new BMap.Geolocation();
geolocation.getCurrentPosition(function(r){
    if(this.getStatus() == BMAP_STATUS_SUCCESS){
        var mk = new BMap.Marker(r.point);
        map.addOverlay(mk);
        console.log(r.point)
        var pt = r.point;
        map.centerAndZoom(pt, 15);
        map.setMapStyleV2({     
            styleId: '832d6efc1a9f9dd2109184e455c7779d'
          });
        geoc.getLocation(pt, function(rs){
            var addComp = rs.addressComponents;
            document.getElementById("my_pos").innerHTML = '您的位置是:' + addComp.province + " " + addComp.city + " " + addComp.district;
            var marker = _markers.filter(item => item.city_type == addComp.city)
            var markers = marker[0].data
            console.log(markers)
            for (var i=0; i<markers.length; i++){
                (function(x){
                            var icon1 = new BMap.Icon("../static/img/marker1.png", new BMap.Size(22, 30));
                            var m = new BMap.Marker(new BMap.Point(markers[x].pos[0],markers[x].pos[1]),{icon:icon1});
                            var opts = {
                                width : 150,     // 信息窗口宽度
                                height: 100,     // 信息窗口高度
                                title : markers[x].name, // 信息窗口标题
                            }  
                            var infoWindow = new BMap.InfoWindow(`地址:${markers[x].add}<br/>电话:${markers[x].tel}`,opts);  // 创建信息窗口对象 
                            m.addEventListener("click", function(){    
                                    map.openInfoWindow(infoWindow, new BMap.Point(markers[x].pos[0],markers[x].pos[1])); //开启信息窗口
                            }); 
                            map.addOverlay(m)
                })(i);    
            }
        });    
    }
    else {
        document.getElementById("my_pos").innerHTML = 'failed'+this.getStatus();
        }
             
 },{enableHighAccuracy: true})
       
